---
kind: other
id: Methods.T:Autodesk.Revit.Exceptions.ArgumentOutOfRangeException
source: html/10f43418-f3dd-e088-3633-f5259bf2a10a.htm
---
# ArgumentOutOfRangeException Methods

Retrieves data needed to serialize the target object.